# Subsetting

In [6]:
import pandas as pd

# Beispiel-Datensatz
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Alter': [23, 35, 45, 28, 22],
        'Gehalt': [70000, 120000, 90000, 80000, 60000],
        'Abteilung': ['HR', 'IT', 'IT', 'Marketing', 'HR']}

df = pd.DataFrame(data)
df

      Name  Alter  Gehalt  Abteilung
0    Alice     23   70000         HR
1      Bob     35  120000         IT
2  Charlie     45   90000         IT
3    David     28   80000  Marketing
4      Eva     22   60000         HR

In [5]:
# Subsetting: Nur bestimmte Spalten anzeigen
df_subset = df[['Name', 'Gehalt']]
df_subset

      Name  Gehalt
0    Alice   70000
1      Bob  120000
2  Charlie   90000
3    David   80000
4      Eva   60000